zephyrproject-rtos/zephyr/drivers/serial/uart_mspm0.c
/*
 * Copyright (c) 2025-2026 Texas Instruments
 * Copyright (c) 2025 Linumiz
 * Copyright (c) 2025 Bang & Olufsen A/S, Denmark
 *
 * SPDX-License-Identifier: Apache-2.0
 */

#define DT_DRV_COMPAT ti_mspm0_uart

/* Zephyr includes */
#include <zephyr/kernel.h>
#include <zephyr/drivers/clock_control.h>
#include <zephyr/drivers/clock_control/mspm0_clock_control.h>
#include <zephyr/drivers/pinctrl.h>
#include <zephyr/drivers/uart.h>
#include <zephyr/dt-bindings/uart/mspm0_uart.h>
#include <zephyr/irq.h>

/*
 * This driver uses its own native register definitions (mspm0_uart_regs and
 * friends) so it does not depend on the SDK's UART_Regs at all.
 */
#ifndef CONFIG_HAS_MSPM0_SDK

/*
 * GPRCM / power and reset
 */
#define UART_PWREN_ENABLE_ENABLE       BIT(0)
#define UART_PWREN_KEY_UNLOCK_W        0x26000000U
#define UART_RSTCTL_RESETASSERT_ASSERT BIT(0)
#define UART_RSTCTL_RESETSTKYCLR_CLR   BIT(1)
#define UART_RSTCTL_KEY_UNLOCK_W       0xB1000000U

/*
 * CTL0 Control Register 0
 */
#define UART_CTL0_ENABLE_MASK   GENMASK(0, 0)
#define UART_CTL0_ENABLE_ENABLE BIT(0)
#define UART_CTL0_HSE_MASK      GENMASK(16, 15)
#define UART_CTL0_HSE_OVS16     FIELD_PREP(UART_CTL0_HSE_MASK, 0)
#define UART_CTL0_HSE_OVS8      FIELD_PREP(UART_CTL0_HSE_MASK, 1)
#define UART_CTL0_HSE_OVS3      FIELD_PREP(UART_CTL0_HSE_MASK, 2)
#define UART_CTL0_RXE_ENABLE    BIT(3)
#define UART_CTL0_TXE_ENABLE    BIT(4)
#define UART_CTL0_RTSEN_MASK    GENMASK(13, 13)
#define UART_CTL0_RTSEN_DISABLE 0U
#define UART_CTL0_RTSEN_ENABLE  BIT(13)
#define UART_CTL0_CTSEN_MASK    GENMASK(14, 14)
#define UART_CTL0_CTSEN_DISABLE 0U
#define UART_CTL0_CTSEN_ENABLE  BIT(14)
#define UART_CTL0_MODE_UART     0U
#define UART_CTL0_FEN_ENABLE    BIT(17)

/*
 * LCRH Line Control Register
 */
#define UART_LCRH_PEN_MASK      GENMASK(1, 1)
#define UART_LCRH_PEN_ENABLE    BIT(1)
#define UART_LCRH_EPS_MASK      GENMASK(2, 2)
#define UART_LCRH_EPS_ODD       0U
#define UART_LCRH_EPS_EVEN      BIT(2)
#define UART_LCRH_STP2_MASK     GENMASK(3, 3)
#define UART_LCRH_STP2_DISABLE  0U
#define UART_LCRH_STP2_ENABLE   BIT(3)
#define UART_LCRH_WLEN_MASK     GENMASK(5, 4)
#define UART_LCRH_WLEN_DATABIT5 FIELD_PREP(UART_LCRH_WLEN_MASK, 0)
#define UART_LCRH_WLEN_DATABIT6 FIELD_PREP(UART_LCRH_WLEN_MASK, 1)
#define UART_LCRH_WLEN_DATABIT7 FIELD_PREP(UART_LCRH_WLEN_MASK, 2)
#define UART_LCRH_WLEN_DATABIT8 FIELD_PREP(UART_LCRH_WLEN_MASK, 3)
#define UART_LCRH_SPS_MASK      GENMASK(6, 6)
#define UART_LCRH_SPS_ENABLE    BIT(6)

/*
 * STAT Status Register
 */
#define UART_STAT_TXFE_MASK GENMASK(6, 6)
#define UART_STAT_TXFF_MASK GENMASK(7, 7)
#define UART_STAT_RXFE_MASK GENMASK(2, 2)

/*
 * IFLS Interrupt FIFO Level Select Register
 */
#define UART_IFLS_TXIFLSEL_MASK      GENMASK(2, 0)
#define UART_IFLS_TXIFLSEL_LVL_3_4   FIELD_PREP(UART_IFLS_TXIFLSEL_MASK, 1)
#define UART_IFLS_TXIFLSEL_LVL_1_2   FIELD_PREP(UART_IFLS_TXIFLSEL_MASK, 2)
#define UART_IFLS_TXIFLSEL_LVL_1_4   FIELD_PREP(UART_IFLS_TXIFLSEL_MASK, 3)
#define UART_IFLS_TXIFLSEL_LVL_EMPTY FIELD_PREP(UART_IFLS_TXIFLSEL_MASK, 5)
#define UART_IFLS_TXIFLSEL_LVL_1     FIELD_PREP(UART_IFLS_TXIFLSEL_MASK, 7)

#define UART_IFLS_RXIFLSEL_MASK     GENMASK(6, 4)
#define UART_IFLS_RXIFLSEL_LVL_1_4  FIELD_PREP(UART_IFLS_RXIFLSEL_MASK, 1)
#define UART_IFLS_RXIFLSEL_LVL_1_2  FIELD_PREP(UART_IFLS_RXIFLSEL_MASK, 2)
#define UART_IFLS_RXIFLSEL_LVL_3_4  FIELD_PREP(UART_IFLS_RXIFLSEL_MASK, 3)
#define UART_IFLS_RXIFLSEL_LVL_FULL FIELD_PREP(UART_IFLS_RXIFLSEL_MASK, 5)
#define UART_IFLS_RXIFLSEL_LVL_1    FIELD_PREP(UART_IFLS_RXIFLSEL_MASK, 7)

#define UART_IFLS_RXTOSEL_MASK GENMASK(11, 8)

/*
 * CPU_INT Interrupt index (IIDX) values
 */
#define UART_CPU_INT_IIDX_STAT_NO_INTR 0x00000000U
#define UART_CPU_INT_IIDX_STAT_RTFG    0x00000001U
#define UART_CPU_INT_IIDX_STAT_FEFG    0x00000002U
#define UART_CPU_INT_IIDX_STAT_BEFG    0x00000004U
#define UART_CPU_INT_IIDX_STAT_RXIFG   0x0000000BU
#define UART_CPU_INT_IIDX_STAT_TXIFG   0x0000000CU
#define UART_CPU_INT_IIDX_STAT_EOT     0x0000000DU

/*
 * CPU_INT Interrupt mask (IMASK) bits
 */
#define UART_CPU_INT_IMASK_FRMERR_SET BIT(1)
#define UART_CPU_INT_IMASK_BRKERR_SET BIT(3)
#define UART_CPU_INT_IMASK_RXINT_SET  BIT(10)
#define UART_CPU_INT_IMASK_TXINT_SET  BIT(11)
#define UART_CPU_INT_IMASK_EOT_SET    BIT(12)
#define UART_CPU_INT_IMASK_RTOUT_SET  BIT(0)

/*
 * CPU_INT Interrupt set (ISET) bits
 */
#define UART_CPU_INT_ISET_RXINT_SET BIT(10)
#define UART_CPU_INT_ISET_TXINT_SET BIT(11)

#endif /* !CONFIG_HAS_MSPM0_SDK */

/*
 * UART register-map structs.
 */
typedef struct {
	volatile const uint32_t iidx; /* (@ 0x00001020) Interrupt index		*/
	uint32_t reserved0;
	volatile uint32_t imask; /* (@ 0x00001028) Interrupt mask			*/
	uint32_t reserved1;
	volatile const uint32_t ris; /* (@ 0x00001030) Raw interrupt status	*/
	uint32_t reserved2;
	volatile const uint32_t mis; /* (@ 0x00001038) Masked interrupt status */
	uint32_t reserved3;
	volatile uint32_t iset; /* (@ 0x00001040) Interrupt set			*/
	uint32_t reserved4;
	volatile uint32_t iclr; /* (@ 0x00001048) Interrupt clear		*/
} mspm0_uart_cpu_int_regs;

typedef struct {
	volatile uint32_t pwren;  /* (@ 0x00000800) Power enable			*/
	volatile uint32_t rstctl; /* (@ 0x00000804) Reset Control			*/
	volatile uint32_t clkcfg; /* (@ 0x00000808) Clock Configuration	*/
	uint32_t reserved0[2];
	volatile const uint32_t stat; /* (@ 0x00000814) Status Register		*/
} mspm0_uart_gprcm_regs;

typedef struct {
	uint32_t reserved0[512];
	mspm0_uart_gprcm_regs gprcm; /* (@ 0x00000800) */
	uint32_t reserved1[506];
	volatile uint32_t clkdiv; /* (@ 0x00001000) Clock Divider  */
	uint32_t reserved2;
	volatile uint32_t clksel; /* (@ 0x00001008) Clock Select	 */
	uint32_t reserved3[3];
	volatile uint32_t pdbgctl; /* (@ 0x00001018) Debug Control	*/
	uint32_t reserved4;
	mspm0_uart_cpu_int_regs cpu_int; /* (@ 0x00001020) */
	/* DMA_TRIG_RX (0x1050), gap, DMA_TRIG_TX (0x1080), padding to 0x10E0 */
	uint32_t reserved5[37];
	volatile uint32_t evt_mode; /* (@ 0x000010E0) Event Mode	 */
	volatile uint32_t intctl;   /* (@ 0x000010E4) Interrupt ctrl */
	uint32_t reserved6[6];
	volatile uint32_t ctl0;       /* (@ 0x00001100) Control Reg 0  */
	volatile uint32_t lcrh;       /* (@ 0x00001104) Line Control	 */
	volatile const uint32_t stat; /* (@ 0x00001108) Status		 */
	volatile uint32_t ifls;       /* (@ 0x0000110C) FIFO Level Sel */
	volatile uint32_t ibrd;       /* (@ 0x00001110) Int Baud Div	 */
	volatile uint32_t fbrd;       /* (@ 0x00001114) Frac Baud Div  */
	volatile uint32_t gfctl;      /* (@ 0x00001118) Glitch Filter  */
	uint32_t reserved7;
	volatile uint32_t txdata;       /* (@ 0x00001120) TX Data		 */
	volatile const uint32_t rxdata; /* (@ 0x00001124) RX Data		 */
	uint32_t reserved8[2];
	volatile uint32_t lincnt; /* (@ 0x00001130) LIN Counter	 */
	volatile uint32_t linctl; /* (@ 0x00001134) LIN Control	 */
	volatile uint32_t linc0;  /* (@ 0x00001138) LIN Capture 0  */
	volatile uint32_t linc1;  /* (@ 0x0000113C) LIN Capture 1  */
	volatile uint32_t irctl;  /* (@ 0x00001140) IrDA Control	 */
	uint32_t reserved9;
	volatile uint32_t amask; /* (@ 0x00001148) Self Addr Mask */
	volatile uint32_t addr;  /* (@ 0x0000114C) Self Address	 */
	uint32_t reserved10[4];
	volatile uint32_t clkdiv2; /* (@ 0x00001160) Clock Divider2 */
} mspm0_uart_regs;

