zephyrproject-rtos/zephyr/drivers/serial/uart_mspm0.c
/*
 * Highest UART Receive Interrupt Timeout
 */
#define UART_IFLS_RXTOSEL_HIGHEST_VAL FIELD_PREP(UART_IFLS_RXTOSEL_MASK, 15)

/*
 * Driver config and data structs
 */
struct uart_mspm0_config {
	mspm0_uart_regs *regs;
	const struct mspm0_sys_clock *clock_subsys;
	const struct pinctrl_dev_config *pinctrl;
	/* Clock configuration */
	uint32_t clk_sel;
	uint32_t clk_div;
#ifdef CONFIG_UART_INTERRUPT_DRIVEN
	void (*irq_config_func)(const struct device *dev);
	/* UART FIFO thresholds */
	uint8_t rx_fifo_threshold;
	uint8_t tx_fifo_threshold;
#endif /* CONFIG_UART_INTERRUPT_DRIVEN */
};

/*
 * Raw register field values for the UART line configuration.
 * Grouped here so they can be accessed as data->uart_config.parity, etc.
 */
struct uart_mspm0_line_config {
	uint32_t parity;      /* LCRH parity bits */
	uint32_t word_length;  /* LCRH WLEN field */
	uint32_t stop_bits;    /* LCRH STP2 field */
	uint32_t flow_control; /* CTL0 RTSEN/CTSEN bits */
};

struct uart_mspm0_data {
	/* Baud Rate */
	uint32_t current_speed;
	/* UART line configuration - raw register field values */
	struct uart_mspm0_line_config uart_config;
#ifdef CONFIG_UART_INTERRUPT_DRIVEN
	/* Callback function pointer */
	uart_irq_callback_user_data_t cb;
	/* Callback function arg */
	void *cb_data;
	/* Pending interrupt backup */
	uint32_t pending_interrupt;
#endif /* CONFIG_UART_INTERRUPT_DRIVEN */
};

#define UART_MSPM0_ENABLE_POWER(regs)                                                              \
	((regs)->gprcm.pwren = (UART_PWREN_KEY_UNLOCK_W | UART_PWREN_ENABLE_ENABLE))
#define UART_MSPM0_RESET(regs)                                                                     \
	((regs)->gprcm.rstctl = (UART_RSTCTL_KEY_UNLOCK_W | UART_RSTCTL_RESETSTKYCLR_CLR |         \
				 UART_RSTCTL_RESETASSERT_ASSERT))
#define UART_MSPM0_ENABLE(regs)  ((regs)->ctl0 |= UART_CTL0_ENABLE_ENABLE)
#define UART_MSPM0_DISABLE(regs) ((regs)->ctl0 &= ~UART_CTL0_ENABLE_MASK)

#ifdef CONFIG_UART_INTERRUPT_DRIVEN
static const uint32_t uart_mspm0_rx_fifo_level[] = {
	[MSPM0_UART_RX_FIFO_LEVEL_ONE_ENTRY] = UART_IFLS_RXIFLSEL_LVL_1,
	[MSPM0_UART_RX_FIFO_LEVEL_1_4_FULL] = UART_IFLS_RXIFLSEL_LVL_1_4,
	[MSPM0_UART_RX_FIFO_LEVEL_1_2_FULL] = UART_IFLS_RXIFLSEL_LVL_1_2,
	[MSPM0_UART_RX_FIFO_LEVEL_3_4_FULL] = UART_IFLS_RXIFLSEL_LVL_3_4,
	[MSPM0_UART_RX_FIFO_LEVEL_FULL] = UART_IFLS_RXIFLSEL_LVL_FULL,
};
static const uint32_t uart_mspm0_tx_fifo_level[] = {
	[MSPM0_UART_TX_FIFO_LEVEL_ONE_ENTRY] = UART_IFLS_TXIFLSEL_LVL_1,
	[MSPM0_UART_TX_FIFO_LEVEL_1_4_EMPTY] = UART_IFLS_TXIFLSEL_LVL_1_4,
	[MSPM0_UART_TX_FIFO_LEVEL_1_2_EMPTY] = UART_IFLS_TXIFLSEL_LVL_1_2,
	[MSPM0_UART_TX_FIFO_LEVEL_3_4_EMPTY] = UART_IFLS_TXIFLSEL_LVL_3_4,
	[MSPM0_UART_TX_FIFO_LEVEL_EMPTY] = UART_IFLS_TXIFLSEL_LVL_EMPTY,
};
#endif /* CONFIG_UART_INTERRUPT_DRIVEN */

static inline void uart_mspm0_set_clock(mspm0_uart_regs *regs, uint32_t clk_sel, uint32_t clk_div)
{
	regs->clksel = clk_sel;
	regs->clkdiv = clk_div;
}

/* Configure line control: parity, word length, stop bits */
static void uart_mspm0_configure_line(mspm0_uart_regs *regs, uint32_t parity, uint32_t word_length,
				      uint32_t stop_bits, uint32_t flow_control)
{
	uint32_t ctl0 = UART_CTL0_MODE_UART | UART_CTL0_RXE_ENABLE | UART_CTL0_TXE_ENABLE |
			(flow_control & (UART_CTL0_RTSEN_MASK | UART_CTL0_CTSEN_MASK));

	uint32_t lcrh = (parity & (UART_LCRH_PEN_MASK | UART_LCRH_EPS_MASK | UART_LCRH_SPS_MASK)) |
			(word_length & UART_LCRH_WLEN_MASK) | (stop_bits & UART_LCRH_STP2_MASK);

	regs->ctl0 = ctl0;
	regs->lcrh = lcrh;
}

/* Configure baud rate - implements same algorithm as DL_UART_configBaudRate */
static void uart_mspm0_configure_baudrate(mspm0_uart_regs *regs, uint32_t uart_clk,
					  uint32_t baudrate)
{
	uint32_t divisor;
	uint32_t hse_setting;

	/* Determine oversampling rate */
	if ((baudrate * 8U) > uart_clk) {
		/* 3x oversampling */
		hse_setting = UART_CTL0_HSE_OVS3;
		divisor = ((uart_clk * 64U) / (baudrate * 3U)) + (1U / 2U);
	} else if ((baudrate * 16U) > uart_clk) {
		/* 8x oversampling */
		hse_setting = UART_CTL0_HSE_OVS8;

		uint32_t adjusted_baud = baudrate / 2U;

		divisor = (((uart_clk * 8U) / adjusted_baud) + 1U) / 2U;
	} else {
		/* 16x oversampling (default) */
		hse_setting = UART_CTL0_HSE_OVS16;
		divisor = (((uart_clk * 8U) / baudrate) + 1U) / 2U;
	}

	/* Apply oversampling setting */
	regs->ctl0 = (regs->ctl0 & ~UART_CTL0_HSE_MASK) | hse_setting;

	/* Set integer and fractional parts */
	regs->ibrd = divisor >> 6U;   /* Integer part */
	regs->fbrd = divisor & 0x3FU; /* Fractional part */

	/* TRM "UART Operation" section:
	 * When updating the baud-rate divisor (IBRD or IFRD), the
	 * LCRH register must also be written to (any bit in LCRH can
	 * be written to for updating the baud-rate divisor).
	 */
	regs->lcrh = regs->lcrh;
}

static int uart_mspm0_poll_in(const struct device *dev, unsigned char *c)
{
	const struct uart_mspm0_config *config = dev->config;
	mspm0_uart_regs *regs = config->regs;

	if ((regs->stat & UART_STAT_RXFE_MASK) != 0U) {
		return -1;
	}

	*c = (unsigned char)(regs->rxdata & 0xFFU);
	return 0;
}

static void uart_mspm0_poll_out(const struct device *dev, unsigned char c)
{
	const struct uart_mspm0_config *config = dev->config;
	mspm0_uart_regs *regs = config->regs;
	unsigned int key;

	/* Skip the irq_lock()s below when in ISR context. */
	if (k_is_in_isr()) {
		while ((regs->stat & UART_STAT_TXFF_MASK) != 0U) {
		}
		regs->txdata = (uint32_t)c;
		return;
	}

	/* Wait until TX FIFO has space, then write atomically.
	 *
	 * The check-and-write must be performed under an IRQ lock as without it
	 * a higher-priority context could preempt between the TXFF check and the
	 * TXDATA write, fill the TX FIFO, and cause this write to silently
	 * drop the byte.
	 */
	do {
		key = irq_lock();
		if ((regs->stat & UART_STAT_TXFF_MASK) == 0U) {
			regs->txdata = (uint32_t)c;
			irq_unlock(key);
			return;
		}
		irq_unlock(key);
	} while (true);
}

static int uart_mspm0_install_configuration(const struct device *dev)
{
	const struct device *clk_dev = DEVICE_DT_GET(DT_NODELABEL(ckm));
	const struct uart_mspm0_config *config = dev->config;
	struct uart_mspm0_data *data = dev->data;
	uint32_t clock_rate;
	uint32_t uart_clk;
	int ret;

