zephyrproject-rtos/zephyr/drivers/serial/uart_mspm0.c
	/* Set clock source and divider */
	uart_mspm0_set_clock(config->regs, config->clk_sel, config->clk_div);

	/* Configure line control */
	uart_mspm0_configure_line(config->regs, data->uart_config.parity,
				  data->uart_config.word_length, data->uart_config.stop_bits,
				  data->uart_config.flow_control);

	/* Get source clock rate */
	ret = clock_control_get_rate(clk_dev, (struct mspm0_sys_clock *)config->clock_subsys,
				     &clock_rate);
	if (ret < 0) {
		return ret;
	}

	/* Calculate UART source clock */
	/* CLKDIV=0 means divide by 1, CLKDIV=1 means divide by 2, etc */
	uart_clk = clock_rate / (config->clk_div + 1U);

	/* Configure baud rate */
	uart_mspm0_configure_baudrate(config->regs, uart_clk, data->current_speed);

	/* Re-enable FIFOs: uart_mspm0_configure_line() overwrites CTL0 entirely,
	 * clearing the FEN bit. Always re-enable FIFOs after reconfiguring the
	 * line control registers so that FIFO-based interrupt thresholds (IFLS)
	 * remain operative.
	 */
	config->regs->ctl0 |= UART_CTL0_FEN_ENABLE;

#ifdef CONFIG_UART_INTERRUPT_DRIVEN
	/* Restore FIFO interrupt level select thresholds. These are also wiped
	 * when the peripheral is reset/re-initialised, so restore them here in
	 * addition to the init() path.
	 *
	 * RX threshold: use LVL_1 (fire on any received byte). LVL_1_2 (0x20)
	 * is undefined for ULP-domain UARTs (MSPM0L series) where only values
	 * 0 and 4 are specified; LVL_1 (0x70) is valid across all variants and
	 * avoids losing bytes when bursts are smaller than the half-full level.
	 */
	config->regs->ifls = (config->regs->ifls & ~UART_IFLS_RXIFLSEL_MASK) |
			     uart_mspm0_rx_fifo_level[config->rx_fifo_threshold];
	config->regs->ifls = (config->regs->ifls & ~UART_IFLS_TXIFLSEL_MASK) |
			     uart_mspm0_tx_fifo_level[config->tx_fifo_threshold];
	config->regs->ifls = (config->regs->ifls & ~UART_IFLS_RXTOSEL_MASK) |
			     UART_IFLS_RXTOSEL_HIGHEST_VAL; /* Highest possible RX timeout */
#endif                                                      /* CONFIG_UART_INTERRUPT_DRIVEN */

	return 0;
}

#ifdef CONFIG_UART_USE_RUNTIME_CONFIGURE

static const uint32_t uart_parity_to_mspm0[5] = {
	0,                                                               /* NONE */
	UART_LCRH_PEN_ENABLE | UART_LCRH_EPS_ODD,                        /* ODD */
	UART_LCRH_PEN_ENABLE | UART_LCRH_EPS_EVEN,                       /* EVEN */
	UART_LCRH_PEN_ENABLE | UART_LCRH_SPS_ENABLE | UART_LCRH_EPS_ODD, /* STICK_ONE */
	UART_LCRH_PEN_ENABLE | UART_LCRH_SPS_ENABLE | UART_LCRH_EPS_EVEN /* STICK_ZERO */
};

static const uint32_t uart_stop_bits_to_mspm0[4] = {
	UINT32_MAX,             /* 0.5 stop bits - not supported */
	UART_LCRH_STP2_DISABLE, /* 1 stop bit */
	UINT32_MAX,             /* 1.5 stop bits - not supported */
	UART_LCRH_STP2_ENABLE   /* 2 stop bits */
};

static const uint32_t uart_data_bits_to_mspm0[4] = {
	UART_LCRH_WLEN_DATABIT5, /* 5 bits */
	UART_LCRH_WLEN_DATABIT6, /* 6 bits */
	UART_LCRH_WLEN_DATABIT7, /* 7 bits */
	UART_LCRH_WLEN_DATABIT8  /* 8 bits */
};

static const uint32_t uart_flow_control_to_mspm0[2] = {
	UART_CTL0_RTSEN_DISABLE | UART_CTL0_CTSEN_DISABLE, /* NONE */
	UART_CTL0_RTSEN_ENABLE | UART_CTL0_CTSEN_ENABLE    /* RTS_CTS */
};

static int uart_mspm0_translate_in(const uint32_t value_array[], int value_array_length,
				   uint8_t uart_cfg_value, uint32_t *mspm0_cfg_value)
{
	if (uart_cfg_value >= value_array_length) {
		return -EINVAL;
	}

	if (value_array[uart_cfg_value] == UINT32_MAX) {
		return -ENOSYS;
	}

	*mspm0_cfg_value = value_array[uart_cfg_value];

	return 0;
}

static int uart_mspm0_translate_out(const uint32_t value_array[], int value_array_length,
				    uint32_t mspm0_cfg_value, uint8_t *uart_cfg_value)
{
	int idx;

	for (idx = 0; idx < value_array_length; idx++) {
		if (value_array[idx] == mspm0_cfg_value) {
			break;
		}
	}

	if (idx == value_array_length || value_array[idx] == UINT32_MAX) {
		return -EINVAL;
	}

	*uart_cfg_value = (uint8_t)idx;

	return 0;
}

static int uart_mspm0_configure(const struct device *dev, const struct uart_config *cfg)
{
	const struct uart_mspm0_config *config = dev->config;
	struct uart_mspm0_data *data = dev->data;
	uint32_t value;
	int ret;

	UART_MSPM0_DISABLE(config->regs);

	data->current_speed = cfg->baudrate;

	ret = uart_mspm0_translate_in(uart_parity_to_mspm0, ARRAY_SIZE(uart_parity_to_mspm0),
				      cfg->parity, &value);
	if (ret != 0) {
		return ret;
	}

	data->uart_config.parity = value;

	ret = uart_mspm0_translate_in(uart_stop_bits_to_mspm0, ARRAY_SIZE(uart_stop_bits_to_mspm0),
				      cfg->stop_bits, &value);
	if (ret != 0) {
		return ret;
	}

	data->uart_config.stop_bits = value;

	ret = uart_mspm0_translate_in(uart_data_bits_to_mspm0, ARRAY_SIZE(uart_data_bits_to_mspm0),
				      cfg->data_bits, &value);
	if (ret != 0) {
		return ret;
	}

	data->uart_config.word_length = value;

	ret = uart_mspm0_translate_in(uart_flow_control_to_mspm0,
				      ARRAY_SIZE(uart_flow_control_to_mspm0), cfg->flow_ctrl,
				      &value);
	if (ret != 0) {
		return ret;
	}

	data->uart_config.flow_control = value;

	ret = uart_mspm0_install_configuration(dev);
	if (ret != 0) {
		return ret;
	}

	UART_MSPM0_ENABLE(config->regs);

	return 0;
}

static int uart_mspm0_config_get(const struct device *dev, struct uart_config *cfg)
{
	struct uart_mspm0_data *data = dev->data;
	int ret;

	cfg->baudrate = data->current_speed;

	ret = uart_mspm0_translate_out(uart_parity_to_mspm0, ARRAY_SIZE(uart_parity_to_mspm0),
				       data->uart_config.parity, &cfg->parity);
	if (ret != 0) {
		return ret;
	}

	ret = uart_mspm0_translate_out(uart_stop_bits_to_mspm0, ARRAY_SIZE(uart_stop_bits_to_mspm0),
				       data->uart_config.stop_bits, &cfg->stop_bits);
	if (ret != 0) {
		return ret;
	}

	ret = uart_mspm0_translate_out(uart_data_bits_to_mspm0, ARRAY_SIZE(uart_data_bits_to_mspm0),
				       data->uart_config.word_length, &cfg->data_bits);
	if (ret != 0) {
		return ret;
	}

	ret = uart_mspm0_translate_out(uart_flow_control_to_mspm0,
				       ARRAY_SIZE(uart_flow_control_to_mspm0),
				       data->uart_config.flow_control, &cfg->flow_ctrl);
	if (ret != 0) {
		return ret;
	}

