zephyrproject-rtos/zephyr/drivers/serial/uart_mspm0.c
	return 0;
}
#endif /* CONFIG_UART_USE_RUNTIME_CONFIGURE */

#ifdef CONFIG_UART_INTERRUPT_DRIVEN
static int uart_mspm0_err_check(const struct device *dev)
{
	struct uart_mspm0_data *data = dev->data;

	switch (data->pending_interrupt) {
	case UART_CPU_INT_IIDX_STAT_BEFG: /* Break error */
		return UART_BREAK;
	case UART_CPU_INT_IIDX_STAT_FEFG: /* Framing error */
		return UART_ERROR_FRAMING;
	default:
		return 0;
	}
}

#define UART_MSPM0_TX_INTERRUPTS (UART_CPU_INT_IMASK_TXINT_SET | UART_CPU_INT_IMASK_EOT_SET)
#define UART_MSPM0_RX_INTERRUPTS (UART_CPU_INT_IMASK_RXINT_SET | UART_CPU_INT_IMASK_RTOUT_SET)

static int uart_mspm0_fifo_fill(const struct device *dev, const uint8_t *tx_data, int size)
{
	const struct uart_mspm0_config *config = dev->config;
	int count = 0;

	while (count < size && ((config->regs->stat & UART_STAT_TXFF_MASK) == 0)) {
		config->regs->txdata = tx_data[count];
		count++;
	}

	return count;
}

static int uart_mspm0_fifo_read(const struct device *dev, uint8_t *rx_data, const int size)
{
	const struct uart_mspm0_config *config = dev->config;
	int count = 0;

	while (count < size && ((config->regs->stat & UART_STAT_RXFE_MASK) == 0)) {
		rx_data[count] = (uint8_t)(config->regs->rxdata & 0xFF);
		count++;
	}

	return count;
}

static void uart_mspm0_irq_tx_enable(const struct device *dev)
{
	const struct uart_mspm0_config *config = dev->config;

	config->regs->cpu_int.imask |= UART_MSPM0_TX_INTERRUPTS;

	/* If the TX FIFO is already empty (below the LVL_EMPTY threshold) the
	 * TXIFG flag may have been cleared by a prior IIDX read without a new
	 * FIFO-drain edge occurring. Force the interrupt pending via ISET so
	 * that the ISR fires immediately rather than waiting for the next byte
	 * to drain through the shift register.
	 */
	if ((config->regs->stat & UART_STAT_TXFE_MASK) != 0U) {
		config->regs->cpu_int.iset = UART_CPU_INT_ISET_TXINT_SET;
	}
}

static void uart_mspm0_irq_tx_disable(const struct device *dev)
{
	const struct uart_mspm0_config *config = dev->config;

	config->regs->cpu_int.imask &= ~UART_MSPM0_TX_INTERRUPTS;
}

static int uart_mspm0_irq_tx_ready(const struct device *dev)
{
	const struct uart_mspm0_config *config = dev->config;
	struct uart_mspm0_data *data = dev->data;

	return ((data->pending_interrupt == UART_CPU_INT_IIDX_STAT_TXIFG) ||
		(data->pending_interrupt == UART_CPU_INT_IIDX_STAT_EOT)) &&
			       ((config->regs->stat & UART_STAT_TXFF_MASK) == 0)
		       ? 1
		       : 0;
}

static void uart_mspm0_irq_rx_enable(const struct device *dev)
{
	const struct uart_mspm0_config *config = dev->config;

	config->regs->cpu_int.imask |= UART_MSPM0_RX_INTERRUPTS;

	/* If the RX FIFO already contains data the RXIFG flag may have been
	 * cleared by a prior IIDX read while the interrupt was masked, without
	 * a new FIFO-fill edge occurring to re-assert it.  Force the interrupt
	 * pending via ISET so the ISR fires immediately to drain any bytes that
	 * accumulated while RX interrupts were disabled.
	 */
	if ((config->regs->stat & UART_STAT_RXFE_MASK) == 0U) {
		config->regs->cpu_int.iset = UART_CPU_INT_ISET_RXINT_SET;
	}
}

static void uart_mspm0_irq_rx_disable(const struct device *dev)
{
	const struct uart_mspm0_config *config = dev->config;

	config->regs->cpu_int.imask &= ~UART_MSPM0_RX_INTERRUPTS;
}

static int uart_mspm0_irq_tx_complete(const struct device *dev)
{
	const struct uart_mspm0_config *config = dev->config;

	return ((config->regs->stat & UART_STAT_TXFE_MASK) != 0) ? 1 : 0;
}

static int uart_mspm0_irq_rx_ready(const struct device *dev)
{
	const struct uart_mspm0_config *config = dev->config;
	struct uart_mspm0_data *data = dev->data;

	return ((data->pending_interrupt == UART_CPU_INT_IIDX_STAT_RXIFG) ||
		(data->pending_interrupt == UART_CPU_INT_IIDX_STAT_RTFG)) &&
			       ((config->regs->stat & UART_STAT_RXFE_MASK) == 0)
		       ? 1
		       : 0;
}

static int uart_mspm0_irq_is_pending(const struct device *dev)
{
	struct uart_mspm0_data *data = dev->data;

	return data->pending_interrupt != UART_CPU_INT_IIDX_STAT_NO_INTR;
}

static void uart_mspm0_irq_update(const struct device *dev)
{
	struct uart_mspm0_data *data = dev->data;
	const struct uart_mspm0_config *config = dev->config;

	data->pending_interrupt = config->regs->cpu_int.iidx;
}

static void uart_mspm0_irq_callback_set(const struct device *dev, uart_irq_callback_user_data_t cb,
					void *cb_data)
{
	struct uart_mspm0_data *const dev_data = dev->data;

	/* Set callback function and data */
	dev_data->cb = cb;
	dev_data->cb_data = cb_data;
}

#define UART_MSPM0_ERROR_INTERRUPTS (UART_CPU_INT_IMASK_BRKERR_SET | UART_CPU_INT_IMASK_FRMERR_SET)

static void uart_mspm0_irq_error_enable(const struct device *dev)
{
	const struct uart_mspm0_config *config = dev->config;

	config->regs->cpu_int.imask |= UART_MSPM0_ERROR_INTERRUPTS;
}

static void uart_mspm0_irq_error_disable(const struct device *dev)
{
	const struct uart_mspm0_config *config = dev->config;

	config->regs->cpu_int.imask &= ~UART_MSPM0_ERROR_INTERRUPTS;
}

static void uart_mspm0_isr(const struct device *dev)
{
	struct uart_mspm0_data *const dev_data = dev->data;

	/* Perform callback if defined */
	if (dev_data->cb) {
		dev_data->cb(dev, dev_data->cb_data);
	}
}
#endif /* CONFIG_UART_INTERRUPT_DRIVEN */

static int uart_mspm0_init(const struct device *dev)
{
	const struct uart_mspm0_config *config = dev->config;
	int ret;

	/* Reset power */
	UART_MSPM0_RESET(config->regs);
	UART_MSPM0_ENABLE_POWER(config->regs);
	msp_delay_peripheral_startup();

	/* Init UART pins */
	ret = pinctrl_apply_state(config->pinctrl, PINCTRL_STATE_DEFAULT);
	if (ret < 0) {
		return ret;
	}

	/* install_configuration() sets FEN and IFLS; just register the IRQ handler */
	ret = uart_mspm0_install_configuration(dev);
	if (ret != 0) {
		return ret;
	}

#ifdef CONFIG_UART_INTERRUPT_DRIVEN
	config->irq_config_func(dev);
#endif /* CONFIG_UART_INTERRUPT_DRIVEN */

	/* Enable UART */
	UART_MSPM0_ENABLE(config->regs);

	return 0;
}

static DEVICE_API(uart, uart_mspm0_driver_api) = {
	.poll_in = uart_mspm0_poll_in,
	.poll_out = uart_mspm0_poll_out,
#ifdef CONFIG_UART_USE_RUNTIME_CONFIGURE
	.configure = uart_mspm0_configure,
	.config_get = uart_mspm0_config_get,
#endif /* CONFIG_UART_USE_RUNTIME_CONFIGURE */
#ifdef CONFIG_UART_INTERRUPT_DRIVEN
	.err_check = uart_mspm0_err_check,
	.fifo_fill = uart_mspm0_fifo_fill,
	.fifo_read = uart_mspm0_fifo_read,
	.irq_tx_enable = uart_mspm0_irq_tx_enable,
	.irq_tx_disable = uart_mspm0_irq_tx_disable,
	.irq_tx_ready = uart_mspm0_irq_tx_ready,
	.irq_rx_enable = uart_mspm0_irq_rx_enable,
	.irq_rx_disable = uart_mspm0_irq_rx_disable,
	.irq_tx_complete = uart_mspm0_irq_tx_complete,
	.irq_rx_ready = uart_mspm0_irq_rx_ready,
	.irq_is_pending = uart_mspm0_irq_is_pending,
	.irq_update = uart_mspm0_irq_update,
	.irq_callback_set = uart_mspm0_irq_callback_set,
	.irq_err_enable = uart_mspm0_irq_error_enable,
	.irq_err_disable = uart_mspm0_irq_error_disable,
#endif /* CONFIG_UART_INTERRUPT_DRIVEN */
};

#ifdef CONFIG_UART_INTERRUPT_DRIVEN
#define MSP_UART_IRQ_DEFINE(inst)                                                                  \
	static void uart_mspm0_##inst##_irq_register(const struct device *dev)                     \
	{                                                                                          \
		IRQ_CONNECT(DT_INST_IRQN(inst), DT_INST_IRQ(inst, priority), uart_mspm0_isr,       \
			    DEVICE_DT_INST_GET(inst), 0);                                          \
		irq_enable(DT_INST_IRQN(inst));                                                    \
	}
#else
#define MSP_UART_IRQ_DEFINE(inst)
#endif /* CONFIG_UART_INTERRUPT_DRIVEN */

